îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x7fc: file p1original.c, line 17.
(gdb) bmain
Undefined command: "bmain".  Try "help".
(gdb) b main
Note: breakpoint 1 also set at pc 0x7fc.
Breakpoint 2 at 0x7fc: file p1original.c, line 17.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:17
17  {
(gdb) n
19    input(&a,&b);
(gdb) n
Enter a value of a,b 
n
20    add(a,b, &sum);
(gdb) n
21    output(a,b,sum);
(gdb) s
output (a=22046, b=1487799456, sum=1487821502) at p1original.c:14
14    printf(" sum of a and b is %d+%d=%d",a,b,sum);
(gdb) p
The history is empty.
(gdb) l
9     *sum=a+b;
10  }
11
12  void output (int a, int b ,int sum)
13  {
14    printf(" sum of a and b is %d+%d=%d",a,b,sum);
15  }
16  int main() 
17  {
18    int a,b,sum;
(gdb) c
Continuing.
 sum of a and b is 22046+1487799456=1487821502[Inferior 1 (process 122) exited normally]
(gdb) Quit
(gdb) 